ERROR = {
    101: '服务器发生错误',
    102: '服务器生错误',
    103: '服务器生错误',
    201: '没有该讨论区，请确认讨论区的名称正确',
    202: '没有该讨论区，请确认讨论区的名称正确',
    301: '请先登录再进行此操作',
    302: '两次输入密码不一致，请确认密码与确认密码一致',
    303: '非法的id，请换用其他id',
    304: '该id已被注册，请换用其他id',
    305: '性别只能选择男(Male)或者女(Female)',
    306: '服务器发生错误，注册失败',
    307: '该用户不存在，请检查用户id是否正确',
    308: '错误的用户名或者密码，登录失败',
    309: '服务器发生错误，注销登录失败',
    310: '添加的好友id不能为空',
    311: '这个id已经是你的好友咯',
    312: '好友数超过上限了',
    314: '收藏夹为空，请添加版块到收藏夹',
    315: '服务器发生错误，收藏版块失败',
    315: '服务器发生错误，取消收藏版块失败',
    320: '服务器发生错误，更新用户信息失败',
    321: '服务器发生错误，更新个人说明失败',
    322: '服务器发生错误，更新签名档失败',
    323: '服务器发生错误，上传头像失败',
    324: '头像只支持jpg格式，十分抱歉',
    325: '服务器发生错误，保存头像失败',
    326: 'id已经激活，无需再次验证',
    401: '错误的讨论区',
    402: '错误的讨论区或您没有执行该操作的权限',
    402: '错误的讨论区或您没有执行该操作的权限',
    405: '系统维护期，外网禁止发文',
    501: '没有该帖子',
    503: '没有该帖子',
    504: '没有该帖子',
    505: '没有该帖子',
    506: '回帖过于频繁，喝口水歇歇～',
    507: '此帖不可回复～',
    508: '上传附件失败',
    509: '服务器发生错误，发帖失败',
    510: '服务器发生错误，删贴失败',
    601: '没有该邮件',
    602: '收件人邮箱已经满了，发信失败',
    603: '错误的收件人或服务器发生错误，发送邮件失败',
    604: '错误的收件人或服务器发生错误，删除邮件失败'
}

DATA_ROOT = 'http://argo.sysu.edu.cn';
DATA_ADMIN = 'jmf';

BOARD_VH = {
    'Employee' : -2,
    'Job' : -1,
    'Sale' : -1,
    'PartTime' : -1
}

DOWHAT2 = [
    {
        list : [
            ['Say','吐槽'],
            ['Joke','讲笑话'],
            ['News','新闻'],
            ['Lecture','讲座信息']
        ]
    },
    {
        list : [
            ['SYSU_Info','中大'],
            ['Job','招聘'],
            ['Parttime','兼职'],
            ['Search','失物招领'],
            ['Sale','跳蚤市场']
        ]
    },
    {
        list : [
            ['Friend','交友'],
            ['Love','情感'],
            ['Memory','记忆'],
            ['Reading','读书'],
            ['Poem','写诗'],
            ['Film','影评'],
            ['Heart','心情随笔'],
            ["Travel", "大江南北"],
            ["ACMICPC", "程序设计竞赛"],
            ["Linux", "Coolest Unix"],
            ["Job", "人才竞赛"],
            ["ArgoBridge", "相聚逸仙"],
            ["Memory", "时光流转"]
        ]
    }
]

DOWHAT = [
    {
        name : '推荐看版',
        list :
        [
            ["BBS_Test", "BBS测试"],
            ["BBS_Help", "BBS使用帮助"],
            ["Travel", "大江南北"],
            ["ACMICPC", "程序设计竞赛"],
            ["Job", "人才竞赛"],
            ["Lecture", "讲座专栏"],
            ["Personal_corpus", "个人文摘区"],
            ["ArgoBridge", "相聚逸仙"],
            ["Memory", "时光流转"]
        ]        
    },
    {
        name : '休闲与娱乐',
        list : [
            ['Say','吐槽'],
            ['Joke','讲笑话'],
            ['News','新闻观点'],
            ['Friend','交友'],
            ['Love','情感'],
            ['Memory','记忆'],
            ['Reading','读书'],
            ['Poem','写诗'],
            ['Film','影评'],
            ['Heart','心情随笔']
        ]
    },
    {
        name : '信息发布',
        list : [
            ['Lecture','讲座信息'],
            ['SYSU_Info','中大'],
            ['Job','招聘'],
            ['Parttime','兼职'],
            ['Search','失物招领'],
            ['Sale','跳蚤市场']
        ]
    }
]

SECNAME = {
    0 : "BBS 系统",
    1 : "校园社团",
    2 : "院系交流",
    3 : "电脑科技",
    4 : "休闲娱乐",
    5 : "文化艺术",
    6 : "学术科学",
    7 : "谈天说地",
    8 : "社会信息",
    9 : "体育健身"
}

TAGLIST = {
    _default : '原创 提问 分享',
    long : '闲聊 提问 中大讲座 招聘 兼职 求购 出售 吐槽 转载 活动公告 原创/请版友指教 原创/请版友阅读 原创/分享 签到',
    Employee : '闲聊 我是师姐 我是师弟 师兄师姐你们好',
    BBS_Help : 'BBS使用求助 BBS实用小贴士',
    Travel : '闲聊 征驴友 有活动拉！',
    ACMICPC : '求助 公告 故事 总结 日常 跟风 解析贴 茶水',
    Job : '招聘启事 实习生 内推名额 师兄/师姐直招',
    Lecture : '中大讲座 同走 活动广告'
}
